var arr = [
"סבי ומורי ר' מנחם ז''ל נצר יחיד לדוד וברטה נוימאיר הי''ד (י''ד סיון תשנ''ט) ת.נ.צ.ב.ה.",
"דוד בן נתנאל נוימאיר הי''ד (טרזינשטט - כ''ז טבת תש''ב) ת.נ.צ.ב.ה.",
"ברטה לבית אינשטיין נוימאיר הי''ד (אושוויץ - כ''ה אייר תש''ד) ת.נ.צ.ב.ה.",
"ר' יקותיאל יהודה, אשתו מלכה, וילדיהם יהושע, פנחס, שרה וברכה למשפחת פרידר הי''ד (שואה-כ''ד אייר) ת.נ.צ.ב.ה.",
"ישעיהו (אלכסנדר) בן שרה ומרדכי ויזנר הי''ד (כ' ניסן תש''ח) ת.נ.צ.ב.ה.",
"שלמה בן ישראל ואסתר אומן הי''ד (י''ט סיון תשמ''ב) ת.נ.צ.ב.ה.",
"דורון בן זאב וסימה זיסרמן הי''ד (כ''ז סיוון תשס''א) ת.נ.צ.ב.ה.",
"טוביה ב''ר מרדכי ושרה ויזנר הי''ד (ט''ז ניסן תשס''ב) ת.נ.צ.ב.ה.",
"ד''ר עוז בן ארי ונילי תיבון הי''ד (כ''ה טבת תשנ''ו) ת.נ.צ.ב.ה.",
"חברי ארי בן דב ולאה תיבון ז''ל (י''ד שבט תשע''ח) ת.נ.צ.ב.ה.",
"חברי נדב בן משה וריבה פרג ז''ל (תשעה באב תשע''ד-זמן ישראל) ת.נ.צ.ב.ה.",
"סבתי חסיבה (חפציבה) בת רחל וחיים ליברטי ז''ל (ה' ניסן תשל''ח) ת.נ.צ.ב.ה.",
"סבי ר' ישועה בן משה וחנינה ליברטי ז''ל (כ''ח כסליו תש''ן) ת.נ.צ.ב.ה.",
"ר' עמנואל בן שמעון והדויק-גיטל סלע ז''ל (ה' אב תשנ''ז) ת.נ.צ.ב.ה.",
"עמליה (מלי) בת ז'נט ושמעון  סלע ז''ל (ב' אדר תשס''ג) ת.נ.צ.ב.ה.",
"רבי שמעון בן אסתר לוי ז''ל (י''ז שבט תש''ל) ת.נ.צ.ב.ה.",
"אסתר נזרי בת מליחה ז''ל (י''ב אב תשמ''ח) ת.נ.צ.ב.ה.",
"עישה בת רחל לוי ז''ל (י''א כסליו תשמ''ט) ת.נ.צ.ב.ה.",
"מסודי חיה בת אסתר לוי ז''ל (כ''ז ניסן תשנ''ח) ת.נ.צ.ב.ה.",
"ר' מאיר בן רבי שמעון ועישה לוי ז''ל (י''ז תשרי תשס''ו) ת.נ.צ.ב.ה.",
"רחל בת אסתר דהן ז''ל (כ''א אב תשע''ה) ת.נ.צ.ב.ה.",
"יצחק בן שלמה וגורג'יה מוקאמל (כ''ז אלול תשע''ד) ת.נ.צ.ב.ה.",
"שלומית (גורג'יה) בת אנג'ל ויצחק חנניה (כ''ו טבת תשע''ב) ת.נ.צ.ב.ה.",
"שלמה בן יצחק ואנג'ל מוקאמל (י''ג אב תשע''ח) ת.נ.צ.ב.ה.",
"ר' משה מילטון בן אושר אנשל ורבקה ריס ז''ל (ט''ז שבט תשל''ג) ת.נ.צ.ב.ה.",
"ר' דוד בן משה חיים ומטל גרנצרז' ז''ל (כ''ח כסליו תשס''ד) ת.נ.צ.ב.ה.",
"מרים אינה בת פולה ואהרן ריס ז''ל (כ''א ניסן תשס''ז) ת.נ.צ.ב.ה.",
"ר' מרדכי ויזנר ב''ר שלום ז''ל (כ''ט אייר תשל''א) ת.נ.צ.ב.ה.",
"שרה בת ר' נתן ויזנר ז''ל (כ''ג אייר תשל''ח) ת.נ.צ.ב.ה.",
"אריה אגבבה בן אליהו ונאג'יה ז''ל (כ''ד חשוון תשס''ט) ת.נ.צ.ב.ה.",
"ז'נט בת לונה ז''ל (ט''ז ניסן תשע''ג) ת.נ.צ.ב.ה.",
"יוכבד חיה בת ז'נט ז''ל (א' חשון תשע''ח) ת.נ.צ.ב.ה.",
"מאיר (מייק) בן חיים ורחל פנחסוב ז''ל (כ''ב אב תשע''ד) ת.נ.צ.ב.ה.",
"אברהם בן משאללה ובולור מתתיהו ז''ל (כ''ב סיון תשע''ט) ת.נ.צ.ב.ה.",
"ר' מאיר בן מסעודה דיין (כ''ח אלול תשע''ט) ת.נ.צ.ב.ה.",
"ר' משה ב''ר שלום ודבורה קאפח ז''ל (ט''ו חשון תש''פ) ת.נ.צ.ב.ה.",
"שרה אגם בת שני ואמיר פלג ז''ל (ד' כסליו תש''פ) ת.נ.צ.ב.ה.",
"אסתר (אלזה) ז''ל בת מלכה ויקותיאל יהודה הי''ד ויזנר (י''ד ניסן תש''פ) ת.נ.צ.ב.ה",
"ר' ישראל יצחק ב''ר מרדכי ושרה ויזנר ז''ל (ט''ז סיון תש''פ) ת.נ.צ.ב.ה.",
"מלכה בת חנה ושמואל ידידיה ז''ל (ט''ז סיון תש''פ) ת.נ..צ.ב.ה.",
"קופל בן מאיר ואסתר שוורץ ז''ל (י''ד תמוז תש''פ) ת.נ.צ.ב.ה.",
"יצחק בן שלמה וציפורה אופנר ז''ל (י''ז תמוז תש''פ) ת.נ.צ.ב.ה.",
"יצחק שרידה בן נונה ז''ל ת.נ.צ.ב.ה.",
"מו''ר הרב אברהם בן יחיאל ואהובה רמר ז''ל (ה' טבת תשנ''ג) ת.נ.צ.ב.ה.",
"הרב אהרן חיים בן הרב יעקב משה הלוי צימרמן ז''ל (ז' אדר ב' תשנ''ה) ת.נ.צ.ב.ה.",
"מו''ר הרב משה צבי בן הרב פתחיה מנקין נריה ז''ל (י''ט כסליו תשנ''ו) ת.נ.צ.ב.ה.",
"הרב צבי ב''ר שלמה ופייגה פייר ז''ל (עשרה בטבת תש''ע) ת.נ.צ.ב.ה.",
"מו''ר הרב אברהם בן נחמיה וגיטל צוקרמן ז''ל (ט''ז חשון תשע''ד) ת.נ.צ.ב.ה.",
"הרב שמעון בן עליה אזואלוס ז''ל (י''ג שבט תשע''ז) ת.נ.צ.ב.ה.",
"חכם אברהם בן שאול ומסעודה חי ז''ל (כ''ט אב תשע''ז) ת.נ.צ.ב.ה.",
"הרב יוסף בן הר' אליהו מנחם אביאור ז''ל (א' אדר א' תשע''ט) ת.נ.צ.ב.ה.",
"הרב יהודה לייב בן אברהם ורחל גרונר (י''ד ניסן תש''פ) ת.נ.צ.ב.ה.",
"הרב אליהו בקשי דורון ז''ל (ח''י ניסן תש''פ) ת.נ.צ.ב.ה.",
"הרב ישעיהו בן צבי והדסה הבר (ל' ניסן תש''פ) ת.נ.צ.ב.ה.",
"הרב נחום אליעזר רבינוביץ ז''ל (י''ב אייר תש''פ) ת.נ.צ.ב.ה.",
"הרב שמעון ביטון (י''ז אב תש''פ) ת.נ.צ.ב.ה.",
"הרב עדין ב''ר אברהם משה ולאה אבן ישראל (שטיינזלץ) (י''ז אב תש''פ) ת.נ.צ.ב.ה.",
"הרב יצחק משה הכהן אידלס (י''ט אב תש''פ) ת.נ.צ.ב.ה."
];






var len = arr.length;


function display_zl(x){
	if (x>=len){
		x=x-len;
	}
	document.getElementById("zl_name").innerHTML = arr[x];
	setTimeout(display_zl,15000,x+1);
}


setTimeout(display_zl,500,0);